УНФ_ТЕСТ/src/Catalogs/КП_ТребуемыеРезультатыИсполнителей/КП_ТребуемыеРезультатыИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КП_ТребуемыеРезультатыИсполнителей</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Основной</name>
      <description>Основной</description>
    </items>
  </predefined>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеТребуемогоРезультата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеГруппыРезультат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтроляРезультата</name>
    <comment>0 - контроль всех результатов, 1 - контроль одного результата, 2 - не контролировать</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьКонтрольРезультатаЕслиВыбранБулевыйРезультатЛожь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыОтчетов</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеРеквизитаВида</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеРеквизитаВидаИностранное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОтчета</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.КП_РезультатыИсполнителейЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ/src/ChartsOfCharacteristicTypes/КП_РезультатыИсполнителейЗадач/КП_РезультатыИсполнителейЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>КП_РезультатыИсполнителейЗадач</name>
  <type>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>ВыборКнопками</name>
      <description>Выбор кнопками панели</description>
      <code>ВыборКнопками</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ЛичнаяВстреча</name>
      <description>Личная встреча</description>
      <code>ЛичнаяВстреча</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ПриложенныйДокумент</name>
      <description>Приложенный документ</description>
      <code>ПриложенныйДокумент</code>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ПриложенныйФайл</name>
      <description>Приложенный файл</description>
      <code>ПриложенныйФайл</code>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>БулевыйРезультат</name>
      <description>Результат (да/нет)</description>
      <code>БулевыйРезультат</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>РезультатДата</name>
      <description>Результат дата</description>
      <code>РезультатДата</code>
      <type>
        <types>Date</types>
      </type>
    </items>
    <items>
      <name>РезультатЧисло</name>
      <description>Результат число</description>
      <code>РезультатЧисло</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ТекстовоеСообщение</name>
      <description>Текстовое сообщение</description>
      <code>ТекстовоеСообщение</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>ТелефонныйОтчет</name>
      <description>Телефонный отчет</description>
      <code>ТелефонныйОтчет</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

УНФ_ТЕСТ/src/Catalogs/КП_ТребуемыеРезультатыИсполнителей/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция формирует и возвращает строку описания результата
// Параметры:
//		ОтчетОбъект - содержит объект для которого формируется строка
// Возвращаемое значение: Строка
Функция СформироватьОписаниеРезультата(ОтчетОбъект) Экспорт
	
	Если КП_ЗадачиПроцессов.ТребуемыйРезультатПроизвольныйОтчет(ОтчетОбъект) Тогда
		СтрокаРезультатаНачало="Требуется результат в произвольном виде";
		СтрокаРезультата=".";
		ВозможенПроизвольныйРезультат=Истина;
		
	Иначе
		СтрокаРезультатаНачало="Требуется предоставить результат в виде ";
		СтрокаРезультата="";
		ВозможенПроизвольныйРезультат=Ложь;
		
	КонецЕсли;
		
	ТребуетсяРезультатТекст=КП_ЗадачиПроцессов.ТребуемыйРезультатТекст(ОтчетОбъект);
	Если ТребуетсяРезультатТекст Тогда
		СтрокаРезультата=СтрокаРезультата+?(СтрокаРезультата="", "", ", ")+"текстового отчета";
	КонецЕсли;
	
	ТребуетсяРезультатБулево=КП_ЗадачиПроцессов.ТребуемыйРезультатБулево(ОтчетОбъект);
	Если ТребуетсяРезультатБулево Тогда
		СтрокаРезультата=СтрокаРезультата+?(СтрокаРезультата="", "", ", ")+"принятия решения (да/нет)";
	КонецЕсли;
	
	ТребуетсяРезультатФайл=КП_ЗадачиПроцессов.ТребуемыйРезультатФайл(ОтчетОбъект);
	Если ТребуетсяРезультатФайл Тогда
		СтрокаРезультата=СтрокаРезультата+?(СтрокаРезультата="", "", ", ")+"файла с отчетом";
	КонецЕсли;
	
	ТребуетсяРезультатДокумент=КП_ЗадачиПроцессов.ТребуемыйРезультатДокумент(ОтчетОбъект);
	Если ТребуетсяРезультатДокумент Тогда
		СтрокаРезультата=СтрокаРезультата+?(СтрокаРезультата="", "", ", ")+"подготовленного документа";
	КонецЕсли;
	
	ТребуетсяРезультатЛичнаяВстреча=КП_ЗадачиПроцессов.ТребуемыйРезультатЛичнаяВстреча(ОтчетОбъект);
	Если ТребуетсяРезультатЛичнаяВстреча Тогда
		СтрокаРезультата=СтрокаРезультата+?(СтрокаРезультата="", "", ", ")+"личной встречи";
	КонецЕсли;
	
	ТребуетсяРезультатТелефонныйЗвонок=КП_ЗадачиПроцессов.ТребуемыйРезультатТелефонныйОтчет(ОтчетОбъект);
	Если ТребуетсяРезультатТелефонныйЗвонок Тогда
		СтрокаРезультата=СтрокаРезультата+?(СтрокаРезультата="", "", ", ")+"телефонного отчета";
	КонецЕсли;
	
	ТребуетсяРезультатЧисло=КП_ЗадачиПроцессов.ТребуемыйРезультатЧисло(ОтчетОбъект);
	Если ТребуетсяРезультатЛичнаяВстреча Тогда
		СтрокаРезультата=СтрокаРезультата+?(СтрокаРезультата="", "", ", ")+"указания числа";
	КонецЕсли;
	
	ТребуетсяРезультатДата=КП_ЗадачиПроцессов.ТребуемыйРезультатДата(ОтчетОбъект);
	Если ТребуетсяРезультатЛичнаяВстреча Тогда
		СтрокаРезультата=СтрокаРезультата+?(СтрокаРезультата="", "", ", ")+"указания даты";
	КонецЕсли;
	
	//соберем строку
	СтрокаТребуемогоРезультата=СтрокаРезультатаНачало+СтрокаРезультата;
	
	Если Прав(СтрокаТребуемогоРезультата, 1)<>"." Тогда
		СтрокаТребуемогоРезультата=СтрокаТребуемогоРезультата+".";
	КонецЕсли;
	
	Возврат СтрокаТребуемогоРезультата;
	
КонецФункции

// Процедура выполняет заполнение списка видов результатов
// Параметры:
//	Объект - ссылка на объект
Процедура ЗаполнитьСписокВидов(Объект) Экспорт
	
	Объект.ВидыОтчетов.Очистить();
		
	НоваяСтрока=Объект.ВидыОтчетов.Добавить();
	НоваяСтрока.ВидОтчета=ПланыВидовХарактеристик.КП_РезультатыИсполнителейЗадач.ТекстовоеСообщение;
	НоваяСтрока.НаименованиеРеквизитаВида="Описание результата";
	НоваяСтрока.Использование=Истина;
	
	НоваяСтрока=Объект.ВидыОтчетов.Добавить();
	НоваяСтрока.ВидОтчета=ПланыВидовХарактеристик.КП_РезультатыИсполнителейЗадач.ТелефонныйОтчет;
	НоваяСтрока.НаименованиеРеквизитаВида=СокрЛП(НоваяСтрока.ВидОтчета);
	НоваяСтрока.Использование=Ложь;
		
	НоваяСтрока=Объект.ВидыОтчетов.Добавить();
	НоваяСтрока.ВидОтчета=ПланыВидовХарактеристик.КП_РезультатыИсполнителейЗадач.ВыборКнопками;
	НоваяСтрока.НаименованиеРеквизитаВида="Одобрить | Отклонить";
	НоваяСтрока.Использование=Ложь;
	
	НоваяСтрока=Объект.ВидыОтчетов.Добавить();
	НоваяСтрока.ВидОтчета=ПланыВидовХарактеристик.КП_РезультатыИсполнителейЗадач.ЛичнаяВстреча;
	НоваяСтрока.НаименованиеРеквизитаВида=СокрЛП(НоваяСтрока.ВидОтчета);
	НоваяСтрока.Использование=Ложь;
	
	НоваяСтрока=Объект.ВидыОтчетов.Добавить();
	НоваяСтрока.ВидОтчета=ПланыВидовХарактеристик.КП_РезультатыИсполнителейЗадач.ПриложенныйДокумент;
	НоваяСтрока.НаименованиеРеквизитаВида="Подготовленный документ";
	НоваяСтрока.Использование=Ложь;
	
	НоваяСтрока=Объект.ВидыОтчетов.Добавить();
	НоваяСтрока.ВидОтчета=ПланыВидовХарактеристик.КП_РезультатыИсполнителейЗадач.РезультатЧисло;
	НоваяСтрока.НаименованиеРеквизитаВида="Числовой результат";
	НоваяСтрока.Использование=Ложь;

	НоваяСтрока=Объект.ВидыОтчетов.Добавить();
	НоваяСтрока.ВидОтчета=ПланыВидовХарактеристик.КП_РезультатыИсполнителейЗадач.РезультатДата;
	НоваяСтрока.НаименованиеРеквизитаВида="Результат дата/время";
	НоваяСтрока.Использование=Ложь;
	
	НоваяСтрока=Объект.ВидыОтчетов.Добавить();
	НоваяСтрока.ВидОтчета=ПланыВидовХарактеристик.КП_РезультатыИсполнителейЗадач.БулевыйРезультат;
	НоваяСтрока.НаименованиеРеквизитаВида="Результат (да/нет)";
	НоваяСтрока.Использование=Ложь;
		
КонецПроцедуры

#КонецОбласти
